{
  "backend/main.mo": "Motoko canister implementing user profiles, authorization checks, blob-backed project storage, and CRUD operations for projects.",
  "feature_evidence.json": "Feature evidence report documenting a frontend error‑parsing improvement with referenced files, components, and test ID REQ‑27.",
  "frontend-file-summaries.txt": "Mapping of many frontend file paths to short descriptive summaries used for build or documentation purposes.",
  "frontend/index.css": "Tailwind CSS setup defining light/dark theme tokens and applying base styling rules.",
  "frontend/index.html": "Minimal HTML shell that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router and wraps the app in AuthGate, theme provider, and toaster notifications.",
  "frontend/src/components/auth/AuthGate.tsx": "Authentication gate that handles II login state, waits for actor readiness, and triggers profile setup when needed.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with loading states and retry logic.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new users to enter a name and save their profile with validation and toast feedback.",
  "frontend/src/components/layout/AppLayout.tsx": "Shared page layout with header, themed background layers, routed content, and footer.",
  "frontend/src/features/editor/AudioEditorPage.tsx": "Main editor page that loads project data, checks backend readiness, initializes the audio engine, and displays upload, controls, panels, mixer, and export UI.",
  "frontend/src/features/editor/components/AILikeAccompanimentPanel.tsx": "Panel for tempo analysis, optional tempo override, and generating AI-based accompaniment stems using the audio engine.",
  "frontend/src/features/editor/components/AudioUploadCard.tsx": "Card for uploading, validating, and loading an audio file into a project, with drag-and-drop, backend readiness checks, and upload progress.",
  "frontend/src/features/editor/components/EqualizerPanel.tsx": "Equalizer UI letting users enable EQ, adjust frequency bands, and reset EQ settings via the audio engine.",
  "frontend/src/features/editor/components/ExportPanel.tsx": "Exports mixed audio or individual stems by rendering buffers offline and triggering file downloads.",
  "frontend/src/features/editor/components/StemMixer.tsx": "Mixer interface for adjusting volume, mute, and solo states of separated or generated stems.",
  "frontend/src/features/editor/components/StemSeparationPanel.tsx": "Panel to start stem separation, display progress or errors, and confirm completion of separated stems.",
  "frontend/src/features/editor/components/TransportControls.tsx": "UI component providing play/pause, seeking, and volume control using the audio engine.",
  "frontend/src/features/editor/hooks/useAudioEngine.ts": "Main audio engine hook managing audio loading, playback, stems, EQ, tempo analysis, and accompaniment generation.",
  "frontend/src/features/editor/hooks/useAudioTransport.ts": "Handles playback state, timing, seeking, and duration tracking for audio transport.",
  "frontend/src/features/editor/hooks/useEqualizer.ts": "Manages equalizer state and filter chain setup for adjustable audio EQ bands.",
  "frontend/src/features/editor/hooks/useStemMixer.ts": "Maintains and updates stem volumes, mute, solo states, and generated stem cleanup.",
  "frontend/src/features/editor/hooks/useStemSeparation.ts": "Simulates stem separation with progress tracking, error handling, and reset support.",
  "frontend/src/features/editor/hooks/useTempoAnalysis.ts": "Provides async tempo estimation with loading and error state management.",
  "frontend/src/features/editor/utils/accompanimentGeneration.ts": "Generates synthesized drum, bass, and guitar accompaniment buffers based on tempo.",
  "frontend/src/features/editor/utils/audioFileValidation.ts": "Validates uploaded audio files for type, MIME, and size limits.",
  "frontend/src/features/editor/utils/download.ts": "Encodes an AudioBuffer to WAV and triggers a browser download.",
  "frontend/src/features/editor/utils/offlineRender.ts": "Renders mixed audio or stems offline, applying volume and EQ as needed.",
  "frontend/src/features/editor/utils/tempoAnalysis.ts": "Implements browser‑only BPM estimation by downsampling audio, detecting energy peaks, and converting intervals to a clamped BPM value.",
  "frontend/src/features/editor/utils/wavEncode.ts": "Encodes an AudioBuffer into a 16‑bit PCM WAV Blob by interleaving channels and writing WAV headers.",
  "frontend/src/features/projects/components/ProjectDialogs.tsx": "Provides a dialog for creating new projects with validation, backend readiness checks, and error‑handled submission.",
  "frontend/src/features/projects/ProjectsPage.tsx": "Displays the projects list with backend readiness handling, loading states, error messaging, and navigation to individual project editors.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes dependent queries when the identity changes.",
  "frontend/src/hooks/useActorConnection.ts": "Builds a resilient backend actor connection with explicit loading/error states and manual retry behavior.",
  "frontend/src/hooks/useBackendReadiness.ts": "Derives a unified readiness state and user‑facing messaging from actor connection status, including retry support.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, loading stored identities, login flow, and exposes identity status via React context.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating user profiles, projects, and project files through the backend actor.",
  "frontend/src/index.css": "Tailwind base styles and custom CSS variables defining light/dark themes and app background layers.",
  "frontend/src/main.tsx": "App entry point initializing React, React Query, Internet Identity provider, and global styles.",
  "frontend/src/utils/backendError.ts": "Utility for extracting and normalizing backend error messages into user-friendly summaries.",
  "frontend/src/utils/urlParams.ts": "Functions to read, persist, and clear URL parameters and session-stored parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, typography, animations, and enabling plugins.",
  "project_state.json": "Project metadata describing app features, issues, and versioned state for planning and fixes."
}