{
  "kind": "build_request",
  "title": "Fix project creation failure by correcting backend user authorization and surfacing real errors",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-26",
      "text": "Fix backend authorization so any authenticated Internet Identity user (non-anonymous principal) can successfully call user-level APIs (including createProject, getCallerUserProfile, saveCallerUserProfile, getAllProjects, getProject, addFileToProject, and other project CRUD methods) after a page refresh without requiring any admin secret token initialization.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "fix",
          "create project",
          "The operation could not be completed. Please try again or contact support if the issue persists."
        ]
      },
      "acceptanceCriteria": [
        "When logged in with Internet Identity, calling createProject succeeds without requiring any URL/admin secret token, including immediately after a hard page refresh.",
        "When not logged in (anonymous), createProject and other user-level APIs reject with a clear English error indicating login is required.",
        "ProjectsPage can load projects for an authenticated user (getAllProjects) without admin initialization.",
        "The change does not require any additional backend services or multiple actors; all logic remains in backend/main.mo."
      ]
    },
    {
      "id": "REQ-27",
      "text": "Improve frontend error extraction/parsing so backend authorization and canister rejection errors are shown to the user as a specific, actionable English message (instead of the generic fallback “The operation could not be completed…”), especially for Create Project failures.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5",
          "msg-6"
        ],
        "quotes": [
          "The operation could not be completed. Please try again or contact support if the issue persists.",
          "create project"
        ]
      },
      "acceptanceCriteria": [
        "If createProject fails due to unauthorized/permission issues, the toast displays an English message indicating the user must be logged in (and does not show only the generic fallback message).",
        "If createProject fails due to a duplicate name (“Project already exists”), the toast instructs the user to choose a different project name.",
        "If createProject fails due to connectivity/actor issues, the toast indicates backend connection failed and suggests retrying.",
        "No user-facing toast or inline error for Create Project uses non-English text."
      ]
    }
  ],
  "constraints": [
    "Respect the single-actor backend architecture; keep all Motoko logic in backend/main.mo.",
    "Do not edit files under frontend/src/hooks/useActor.ts or other frontend immutablePaths.",
    "Do not introduce external databases, third-party auth providers, or external services."
  ],
  "nonGoals": [
    "Adding new project features (sharing, folders, tags, templates).",
    "Changing the audio editor, stem separation, EQ, or export behavior.",
    "Implementing customizable background image upload/selection (not part of this fix request)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}