{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Surface actionable backend authorization and create-project errors in the UI",
  "requirements": [
    {
      "id": "REQ-27",
      "summary": "Improve frontend error extraction/parsing so createProject failures show specific, actionable English messages instead of a generic fallback toast.",
      "acceptanceCriteria": [
        "If createProject fails due to unauthorized/permission issues, the toast displays an English message indicating the user must be logged in (and does not show only the generic fallback message).",
        "If createProject fails due to a duplicate name (“Project already exists”), the toast instructs the user to choose a different project name.",
        "If createProject fails due to connectivity/actor issues, the toast indicates backend connection failed and suggests retrying.",
        "No user-facing toast or inline error for Create Project uses non-English text."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/backendError.ts",
          "operation": "modify",
          "description": "Harden error extraction to reliably pull the most relevant rejection reason from common canister/agent error shapes (e.g., nested message fields, reject messages), then map it to user-actionable English messages. Prioritize matching for auth/login-required cases (including anonymous/guest principals and authorization traps), duplicate project name cases, and connection/actor availability cases. Remove/avoid the current overly-generic trap/reject fallback so Create Project can display the real actionable message when available."
        },
        {
          "path": "frontend/src/features/projects/components/ProjectDialogs.tsx",
          "operation": "modify",
          "description": "Ensure Create Project failures always display a specific English toast derived from the improved formatter, with a Create Project–specific English fallback message when parsing yields an unhelpful generic result. Keep console logging for debugging, but do not show non-English or raw technical rejection strings to users."
        }
      ]
    }
  ]
}